# Task 1

# first_number = int(input(f"Enter the first number "))
# second_number = int(input(f"Enter the first number "))
# third_number = int(input(f"Enter the first number "))
#
# make_list = [first_number, second_number, third_number]
# print(make_list)
# print(f"Sum: {sum(make_list)}")
# print(f"Max: {max(make_list)}")
# print(f"Min: {min(make_list)}")

# Task 2

# Напишите программу, которая выводит: сумму, максимальное и минимальное из исходных чисел: a=54, b=87.

# a = 54
# b = 87
# make_list = [a, b]
# print(make_list)
# print(f"Sum: {sum(make_list)}")
# print(f"Max: {max(make_list)}")
# print(f"Min: {min(make_list)}")

# Task 3

# Напишите программу, которая генерирует тридцать чисел
# и заполняет ими список. Выводит получившийся список на экран по десять элементов в ряд.
# Далее сортирует список с помощью метода sort() и снова выводит его на экран по десять элементов в строке.
# Для вывода списка напишите отдельную функцию, в качестве аргумента она должна принимать список.


# def print_tens(list):
#
#     print(list[0:10])
#     print(list[10:20])
#     print(list[20:])
#
#
# a = list(range(-1, -30, -3))
# b = list(range(1, 30, 3))
# c = list(range(-32, -61, -3))
#
# d = a+b+c
# d.sort()
#
# print_tens(d)



